odoo.define('mail.emojiUnicodes', function (require) {
"use strict";

var emojiUnicodes = {
    ":)":             "😊",
    ":-)":            "😊", // alternative (alt.)
    "=)":             "😊", // alt.
    ":]":             "😊", // alt.
    ":D":             "😃",
    ":-D":            "😃", // alt.
    "=D":             "😃", // alt.
    "xD":             "😆",
    "XD":             "😆", // alt.
    "x'D":            "😂",
    ";)":             "😉",
    ";-)":            "😉", // alt.
    "B)":             "😎",
    "8)":             "😎", // alt.
    "B-)":            "😎", // alt.
    "8-)":            "😎", // alt.
    ";p":             "😜",
    ";P":             "😜", // alt.
    ":p":             "😋",
    ":P":             "😋", // alt.
    ":-p":            "😋", // alt.
    ":-P":            "😋", // alt.
    "=P":             "😋", // alt.
    "xp":             "😝",
    "xP":             "😝", // alt.
    "o_o":            "😳",
    ":|":             "😐",
    ":-|":            "😐", // alt.
    ":/":             "😕", // alt.
    ":-/":            "😕", // alt.
    ":(":             "😞",
    ":@":             "😱",
    ":O":             "😲",
    ":-O":            "😲", // alt.
    ":o":             "😲", // alt.
    ":-o":            "😲", // alt.
    ":'o":            "😨",
    "3:(":            "😠",
    ">:(":            "😠", // alt.
    "3:":             "😠", // alt.
    "3:)":            "😈",
    ">:)":            "😈", // alt.
    ":*":             "😘",
    ":-*":            "😘", // alt.
    "o:)":            "😇",
    ":'(":            "😢",
    ":'-(":           "😭",
    ":\"(":           "😭", // alt.
    "&lt;3":          "❤️",
    ":heart":         "❤️", // alt.
    ":heart_eyes":    "😍",
    ":turban":        "👳",
    ":+1":            "👍",
    ":-1":            "👎",
    ":ok":            "👌",
    ":poop":          "💩",
    ":no_see":        "🙈",
    ":no_hear":       "🙉",
    ":no_speak":      "🙊",
    ":bug":           "🐞",
    ":kitten":        "😺",
    ":bear":          "🐻",
    ":snail":         "🐌",
    ":boar":          "🐗",
    ":clover":        "🍀",
    ":sunflower":     "🌹",
    ":fire":          "🔥",
    ":sun":           "☀️",
    ":partly_sunny:": "⛅️",
    ":rainbow":       "🌈",
    ":cloud":         "☁️",
    ":zap":           "⚡️",
    ":star":          "⭐️",
    ":cookie":        "🍪",
    ":pizza":         "🍕",
    ":hamburger":     "🍔",
    ":fries":         "🍟",
    ":cake":          "🎂",
    ":cake_part":     "🍰",
    ":coffee":        "☕️",
    ":banana":        "🍌",
    ":sushi":         "🍣",
    ":rice_ball":     "🍙",
    ":beer":          "🍺",
    ":wine":          "🍷",
    ":cocktail":      "🍸",
    ":tropical":      "🍹",
    ":beers":         "🍻",
    ":ghost":         "👻",
    ":skull":         "💀",
    ":et":            "👽",
    ":alien":         "👽", // alt.
    ":party":         "🎉",
    ":trophy":        "🏆",
    ":key":           "🔑",
    ":pin":           "📌",
    ":postal_horn":   "📯",
    ":music":         "🎵",
    ":trumpet":       "🎺",
    ":guitar":        "🎸",
    ":soccer":        "⚽️",
    ":football":      "🏈",
    ":8ball":         "🎱",
    ":clapper":       "🎬",
    ":microphone":    "🎤"
};

return emojiUnicodes;

});
